# Interacting with Databases

Will be covered:
1.Sqlite
2.NoSql
3.Mongodb
4.mySQL - Basic
5.Few DB script avaliable in the OOPS chapter also
Sequence of teaching:
Pandas
Numpy
Matplotlib
Seaborn
Ploty
Database
API
Deployement

In [52]:
# Install https://sqlitebrowser.org to browse the data

In [15]:
# https://www.sqlite.org/index.html
#Sqlite is most used data base - Maximum database size 2GB, All mobiles are using sqlite.
# We can use cross platform
# Default in present in python 3.6 above.

<b> # Please open the file C:\MachineLearning\DB.Browser.for.SQLite-win64\DB Browser for SQLite & explore <b>

In [37]:
# Refer w3 sc
import pandas as pd
import numpy as np
import sqlite3
# connecting existing file or If not will create new one.
conn = sqlite3.connect("my_database5.squlite")
# Drop table name test if it already exist using execute() method.  "drop table if exists test" -Query command
# Here create test database
con.execute("drop table if exists test")
# Create the query - Table name test, 
# a column has 20 charater b column has 20 character c column has real number d column has integer
# Captical letter inticate query we are going to create
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
# excute the query
# Commit the query
con.execute(query)
con.commit()

In [38]:
# Create the tuple of list & insert the data into database
# Insert multiple record we are usding list
# Here ? is place holder
# Executemany record by record until
# Then commit
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [47]:
# Read the data from test table
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [48]:
# Description provide the column name a,b,c,d
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [49]:
# Extarct the first record
cursor.description[0]

('a', None, None, None, None, None, None)

In [51]:
# List comperhension provide the column name & Insert the rows
[x[0] for x in cursor.description]

['a', 'b', 'c', 'd']

In [50]:
# Read the data & convert record into databased
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [54]:
# Anotherway creation
import sqlite3 as lite
# Here database name test1
# Tabel name is cars with id INT, name TEXT, price INT columns
con1 = lite.connect('test2.db')
con1.execute("drop table if exists cars")
with con:

    cur1 = con1.cursor()

    cur1.execute("CREATE TABLE cars(id INT, name TEXT, price INT)")
    cur1.execute("INSERT INTO cars VALUES(1,'Audi',52642)")
    cur1.execute("INSERT INTO cars VALUES(2,'Mercedes',57127)")
    cur1.execute("INSERT INTO cars VALUES(3,'Skoda',9000)")
    cur1.execute("INSERT INTO cars VALUES(4,'Volvo',29000)")
    cur1.execute("INSERT INTO cars VALUES(5,'Bentley',350000)")
    cur1.execute("INSERT INTO cars VALUES(6,'Citroen',21000)")
    cur1.execute("INSERT INTO cars VALUES(7,'Hummer',41400)")
    cur1.execute("INSERT INTO cars VALUES(8,'Volkswagen',21600)")
con1.commit()

In [58]:
# Read data from test1
cursor1 = con1.execute('select * from cars')
rows1 = cursor1.fetchall()
rows1
# rows1 = cursor1.fetchone()
# rows1

[(1, 'Audi', 52642),
 (2, 'Mercedes', 57127),
 (3, 'Skoda', 9000),
 (4, 'Volvo', 29000),
 (5, 'Bentley', 350000),
 (6, 'Citroen', 21000),
 (7, 'Hummer', 41400),
 (8, 'Volkswagen', 21600)]

In [59]:
# column name
cursor1.description

(('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('price', None, None, None, None, None, None))

In [61]:
cursor1.description
cars = pd.DataFrame(rows1, columns=[x[0] for x in cursor1.description])
cars.head()

   id      name   price
0   1      Audi   52642
1   2  Mercedes   57127
2   3     Skoda    9000
3   4     Volvo   29000
4   5   Bentley  350000

In [5]:
#!/usr/bin/python

import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database5.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists grades1")
# Create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [6]:
db.commit()

In [7]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(103, 'James', 80)
(104, 'Cathy', 85)
(105, 'Kris', 95)
------------------------------------------------------------

In [8]:
results = db.execute("select * from grades1 where name = 'Gary' ")
for row in results: print(row)
print("-"* 60 )

(102, 'Gary', 90)
------------------------------------------------------------

In [9]:
results = db.execute("select * from grades1 where score >= 90 ")
for row in results:
    print(row)
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(105, 'Kris', 95)
------------------------------------------------------------

In [10]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)
print("-" * 60 )

('John', 99)
('Kris', 95)
('Gary', 90)
('Cathy', 85)
('James', 80)
------------------------------------------------------------

In [11]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)
print("-" * 60 )

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)
------------------------------------------------------------

In [12]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)